<PAD>
<UNK>
<BOS>
<EOS>
<SEP>
 
!
"
'
(
)
，
.
0
1
2
3
4
5
6
7
8
9
:
;
?
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
—
‘
’
“
”
…
。
一
丁
七
丄
万
丈
三
上
下
丌
不
与
丏
丐
丑
专
且
丕
世
丘
丙
业
丛
东
丝
丞
丢
两
严
丧
丨
个
丫
中
丰
串
临
丶
丸
丹
为
主
丼
丽
举
丿
乂
乃
久
么
义
之
乌
乍
乎
乏
乐
乒
乓
乔
乖
乘
乙
乜
九
乞
也
习
乡
书
乩
买
乱
乳
乸
乾
了
亇
予
争
亊
事
二
亍
于
亏
云
互
亓
五
井
亘
亚
些
亟
亡
亢
交
亥
亦
产
亨
亩
享
京
亭
亮
亲
亳
亵
亶
亷
人
亻
亽
亾
亿
什
仁
仂
仃
仄
仅
仆
仇
仈
仉
今
介
仌
仍
从
仐
仑
仓
仔
仕
他
仗
付
仙
仚
仛
仝
仞
仟
仡
代
令
以
仨
仩
仪
仫
们
仮
仰
仲
仳
仵
件
价
仺
任
仼
份
仿
企
伉
伊
伍
伎
伏
伐
休
众
优
伙
会
伛
伝
伞
伟
传
伢
伤
伥
伦
伧
伪
伫
伬
伭
伮
伯
估
伱
伲
伴
伶
伸
伺
似
伽
伾
佀
佁
佃
但
位
低
住
佐
佑
体
何
佗
佘
余
佚
佛
作
佝
佞
佟
你
佢
佣
佤
佥
佧
佩
佫
佬
佯
佰
佳
佴
佶
佷
佸
佺
佻
佼
佽
佾
使
侂
侃
侄
侈
侉
例
侍
侏
侑
侓
侔
侗
供
依
侠
侣
侥
侦
侧
侨
侩
侪
侬
侮
侯
侵
侸
侾
便
促
俄
俅
俆
俈
俊
俋
俎
俏
俐
俑
俗
俘
俚
俛
保
俞
俟
信
俢
俣
俤
俦
俨
俩
俪
俬
俭
修
俯
俰
俱
俳
俵
俶
俸
俺
俾
倈
倌
倍
倏
倒
倓
倔
倘
候
倚
倜
倞
借
倠
倡
倥
倦
倨
倩
倪
倬
倭
倮
倲
倷
债
倻
值
倾
偃
偅
假
偈
偊
偌
偎
偏
偐
偕
偙
做
偛
停
偠
偣
健
偪
偬
偰
偲
偶
偷
偸
偻
偾
偿
傀
傃
傅
傈
傌
傍
傒
傕
傚
傛
傜
傞
傣
傥
傧
储
傩
催
傲
傻
僈
像
僖
僚
僜
僦
僧
僭
僮
僰
僳
僵
僻
儆
儇
儋
儏
儒
儛
儡
儴
儹
儿
兀
允
兂
元
兄
充
兆
先
光
克
免
兎
児
兑
兔
兕
兖
兘
党
兜
兢
入
全
八
公
六
兮
兯
兰
共
兲
关
兴
兵
其
具
典
兹
养
兼
兽
冀
内
円
冇
冈
冉
册
再
冏
冒
冓
冔
冕
冗
写
冚
军
农
冠
冢
冤
冥
冧
冨
冩
冬
冮
冯
冰
冲
决
冴
况
冶
冷
冻
冼
冽
净
凃
凄
准
凇
凉
凊
凋
凌
减
凑
凖
凛
凝
几
凡
凤
凥
凪
凫
凭
凯
凰
凳
凶
凸
凹
出
击
凼
函
凿
刀
刁
刂
刃
分
切
刈
刊
刋
刍
刎
刑
划
列
刘
则
刚
创
初
删
判
刧
刨
利
别
刭
刮
到
刳
制
刷
券
刹
刺
刻
刽
刿
剀
剁
剂
剃
剉
削
剌
前
剐
剑
剔
剖
剜
剞
剡
剥
剧
剩
剪
副
割
剽
剿
劈
劏
力
劝
办
功
加
务
劢
劣
劦
动
助
努
劫
劬
劭
励
劲
劳
劵
効
劻
劼
劾
势
勀
勃
勅
勇
勉
勋
勍
勐
勑
勒
勔
勖
勘
募
勤
勫
勬
勭
勮
勯
勰
勲
勳
勶
勷
勺
勾
勿
匀
匁
包
匆
匈
匋
匍
匏
匐
匕
化
北
匙
匜
匝
匠
匡
匣
匦
匪
匮
匹
区
医
匾
匿
十
千
卅
升
午
卉
半
卌
卍
华
协
卑
卒
卓
单
卖
南
博
卜
卞
卟
占
卡
卢
卣
卤
卦
卧
卫
卭
卮
卯
印
危
卲
即
却
卵
卷
卸
卺
卾
卿
厂
厄
厅
历
厉
压
厌
厍
厐
厓
厕
厘
厚
厜
厝
原
厢
厣
厤
厥
厦
厨
厩
厮
厰
厵
去
厾
县
叁
参
叄
叆
又
叉
及
友
双
反
収
叏
发
叔
叕
取
受
变
叙
叛
叟
叠
叡
口
古
句
另
叧
叨
叩
只
叫
召
叭
叮
可
台
叱
史
右
叵
叶
号
司
叹
叻
叼
叽
叿
吁
吃
各
吅
吆
吇
合
吉
吊
同
名
后
吏
吐
向
吒
吓
吔
吕
吖
吗
君
吝
吞
吟
吠
吡
吣
吤
吥
否
吧
吨
吩
吪
含
听
吭
吮
启
吰
吱
吲
吴
吵
吷
吸
吹
吻
吼
吽
吾
呀
呃
呆
呈
告
呋
呍
呐
呑
呒
呓
呔
呕
呖
呗
员
呙
呛
呜
呢
呣
呤
呦
周
呭
呮
呯
呱
呲
味
呴
呵
呶
呷
呸
呻
呼
命
呾
呿
咀
咁
咂
咃
咄
咆
咋
和
咍
咎
咏
咐
咑
咒
咔
咕
咖
咗
咙
咚
咛
咝
咢
咣
咤
咥
咦
咧
咨
咩
咪
咫
咬
咭
咯
咱
咲
咳
咴
咵
咸
咻
咽
咾
咿
哀
品
哂
哃
哄
哆
哇
哈
哉
哋
哌
响
哎
哏
哐
哑
哒
哓
哔
哕
哖
哗
哙
哚
哜
哝
哞
哟
哥
哦
哧
哨
哩
哪
哭
哮
哲
哳
哺
哼
哽
唁
唆
唇
唉
唊
唎
唏
唐
唑
唔
唛
唠
唢
唤
唦
唧
唬
售
唯
唰
唱
唳
唵
唷
唻
唼
唾
唿
啁
啃
啄
商
啈
啉
啊
啐
啓
啕
啖
啘
啜
啡
啤
啥
啦
啧
啪
啫
啬
啭
啮
啯
啰
啱
啲
啵
啶
啷
啸
啻
啼
啾
喀
喁
喂
喃
善
喆
喇
喈
喉
喊
喋
喎
喏
喐
喑
喔
喘
喙
喛
喜
喝
喟
喦
喧
喨
喱
喳
喵
喷
喹
喺
喻
喽
喾
嗀
嗄
嗅
嗉
嗌
嗍
嗐
嗑
嗒
嗓
嗔
嗕
嗖
嗗
嗛
嗜
嗝
嗞
嗟
嗡
嗣
嗤
嗥
嗦
嗨
嗪
嗫
嗬
嗭
嗮
嗯
嗰
嗱
嗲
嗳
嗵
嗷
嗽
嘀
嘁
嘅
嘈
嘉
嘌
嘎
嘏
嘘
嘚
嘛
嘞
嘟
嘠
嘡
嘢
嘣
嘤
嘥
嘧
嘬
嘭
嘱
嘲
嘴
嘶
嘹
嘻
嘿
噁
噃
噆
噉
噌
噍
噎
噏
噔
噗
噘
噙
噜
噢
噤
噧
器
噩
噪
噫
噬
噰
噱
噶
噻
噼
噽
嚅
嚆
嚎
嚏
嚐
嚒
嚓
嚖
嚗
嚟
嚢
嚣
嚬
嚭
嚯
嚱
嚷
嚹
嚼
嚿
囊
囍
囔
囖
囗
囘
囚
四
囝
回
囟
因
囡
团
団
囤
囧
囨
囩
囫
园
囯
困
囱
围
囵
囷
囸
囹
固
国
图
囿
圃
圄
圆
圈
圉
圊
圌
圏
圐
圙
圜
土
圠
圣
在
圩
圪
圫
圬
圭
圮
圯
地
圳
圴
圹
场
圻
圾
址
坁
坂
坆
均
坊
坍
坎
坏
坐
坑
块
坚
坛
坜
坝
坞
坟
坠
坡
坣
坤
坦
坨
坩
坪
坫
坬
坭
坯
坳
坵
坶
坷
坻
坼
垂
垃
垄
垅
垆
型
垌
垎
垒
垓
垕
垚
垛
垜
垟
垠
垡
垢
垣
垤
垦
垧
垩
垪
垫
垭
垮
垱
垲
垳
垴
垵
垸
垽
埂
埃
埄
埇
埈
埋
埌
城
埒
埓
埔
埕
埖
埗
埘
埙
埚
埛
埜
埝
域
埠
埤
埥
埧
埫
埭
埮
埯
埴
埵
埸
培
基
埼
埽
堀
堂
堃
堆
堇
堈
堉
堌
堍
堎
堑
堕
堙
堞
堟
堠
堡
堢
堣
堤
堦
堪
堮
堰
堵
堺
堽
塀
塂
塄
塅
塆
塈
塌
塍
塐
塑
塔
塘
塙
塚
塝
塞
塩
填
塬
塭
塱
塲
塽
塾
墀
墁
境
墅
墈
墉
墍
墒
墓
墕
墖
増
墘
墙
墚
墝
增
墟
墣
墦
墨
墩
墪
墬
墰
壁
壅
壆
壊
壍
壑
壕
壝
壤
士
壬
壮
声
売
壳
壵
壶
壸
壹
处
备
変
夊
夋
夌
复
夏
夑
夔
夕
外
夙
多
夜
够
夤
夥
大
天
太
夫
夭
央
夯
失
夲
头
夷
夸
夹
夺
夻
夼
奀
奁
奂
奄
奇
奈
奉
奋
奌
奍
奎
奏
契
奓
奔
奕
奖
套
奘
奚
奞
奠
奡
奢
奤
奥
奬
奭
奰
女
奴
奶
奸
她
好
妁
如
妃
妄
妆
妇
妈
妊
妌
妍
妒
妓
妖
妗
妘
妙
妞
妣
妤
妥
妨
妩
妪
妫
妭
妮
妯
妲
妸
妹
妺
妻
妾
姆
姊
始
姏
姐
姑
姒
姓
委
姗
姘
姚
姜
姝
姞
姟
姠
姣
姤
姥
姨
姩
姫
姬
姮
姱
姴
姵
姸
姹
姻
姽
姿
威
娃
娄
娅
娆
娇
娈
娉
娋
娌
娑
娓
娘
娚
娜
娞
娟
娠
娣
娤
娥
娩
娭
娱
娲
娴
娶
娼
婀
婂
婆
婉
婊
婍
婓
婕
婚
婞
婢
婥
婧
婪
婫
婬
婳
婴
婵
婶
婷
婺
婼
婿
媂
媄
媒
媓
媖
媗
媚
媛
媜
媞
媪
媬
媲
媳
媵
媸
媺
媾
媿
嫁
嫂
嫄
嫈
嫉
嫌
嫏
嫑
嫒
嫔
嫖
嫘
嫚
嫜
嫠
嫡
嫣
嫦
嫩
嫪
嫫
嫰
嫱
嫲
嫿
嬅
嬉
嬗
嬛
嬢
嬩
嬫
嬬
嬭
嬲
嬴
嬷
嬿
孀
孄
子
孑
孓
孔
孕
孖
字
存
孙
孚
孛
孜
孝
孟
孢
季
孤
孥
学
孩
孪
孬
孰
孱
孳
孵
孺
孻
孽
宁
它
宄
宅
宇
守
安
宋
完
宍
宏
宑
宓
宕
宗
官
宙
定
宛
宜
宝
实
実
宠
审
客
宣
室
宥
宦
宧
宪
宫
宬
宰
害
宴
宵
家
宸
容
宽
宾
宿
寀
寂
寃
寄
寅
密
寇
富
寐
寑
寒
寓
寔
寕
寖
寘
寛
寝
寞
察
寡
寤
寥
寨
寭
寮
寯
寰
寲
寳
寸
对
寺
寻
导
対
寿
封
射
尅
将
尉
尊
小
尐
少
尒
尓
尔
尕
尖
尗
尘
尙
尚
尛
尜
尝
尞
尟
尢
尤
尥
尧
尬
尯
就
尴
尸
尹
尺
尻
尼
尽
尾
尿
局
屁
层
屃
屄
居
屈
屉
届
屋
屌
屍
屎
屏
屐
屑
展
屙
屛
属
屠
屡
屣
履
屦
屯
山
屲
屴
屹
屺
屽
屾
屿
岀
岁
岂
岃
岈
岌
岐
岑
岔
岖
岗
岘
岙
岚
岛
岜
岞
岠
岢
岣
岦
岩
岫
岬
岭
岱
岳
岵
岷
岸
岺
岽
岿
峁
峃
峄
峇
峋
峒
峔
峙
峠
峡
峣
峤
峥
峦
峧
峨
峪
峭
峯
峰
峳
峻
峿
崀
崁
崂
崃
崆
崇
崋
崎
崐
崑
崔
崖
崚
崛
崝
崞
崟
崤
崦
崧
崩
崭
崮
崯
崴
崽
崾
嵁
嵇
嵊
嵋
嵌
嵎
嵑
嵖
嵗
嵘
嵚
嵛
嵣
嵨
嵩
嵬
嵯
嵴
嶂
嶃
嶅
嶆
嶈
嶋
嶌
嶙
嶝
嶦
嶷
巅
巇
巉
巍
巘
巛
川
州
巟
巡
巢
工
左
巧
巨
巩
巫
差
巯
己
已
巳
巴
巵
巷
巻
巽
巾
巿
帀
币
市
布
帅
帆
师
希
帏
帐
帑
帓
帔
帕
帖
帘
帙
帚
帛
帜
帝
帡
帢
带
帧
帨
席
帮
帯
帰
帱
帴
帷
常
帹
帻
帼
帽
帾
幂
幄
幅
幆
幇
幌
幑
幔
幕
幙
幛
幞
幡
幢
干
平
年
幵
并
幷
幸
幺
幻
幼
幽
广
庁
広
庄
庅
庆
庇
床
庋
序
庐
庑
庒
库
应
底
庖
店
庙
庚
府
庝
庞
废
庠
庡
庢
庣
庥
度
座
庨
庭
庯
庳
庵
庶
康
庸
庹
庾
廉
廊
廋
廒
廓
廖
廘
廙
廛
廨
廪
廯
廴
延
廷
廸
廹
建
廻
廼
廿
开
弁
异
弃
弄
弆
弈
弊
弋
弌
式
弑
弓
引
弗
弘
弛
弟
张
弢
弥
弦
弧
弩
弪
弭
弯
弱
弶
弹
强
弼
弾
彀
彁
彂
彅
彐
归
当
彔
录
彗
彘
彛
彝
彟
彡
形
彤
彦
彧
彩
彪
彬
彭
彰
影
彳
彴
彷
彸
役
彻
彼
往
征
徂
徃
径
待
徇
很
徉
徊
律
徐
徒
徔
徕
得
徘
徙
徜
御
徨
循
徫
徭
微
徳
徴
徵
徶
德
徼
徽
心
必
忆
忉
忌
忍
忏
忐
忑
忒
忓
忔
忕
忖
志
忘
忙
忝
忞
忠
忡
忤
忧
忪
快
忭
忮
忱
忲
忴
念
忸
忻
忽
忾
忿
怀
态
怂
怃
怄
怅
怆
怍
怎
怏
怒
怔
怕
怖
怗
怘
怙
怛
怜
思
怠
怡
急
怦
性
怨
怩
怪
怫
怯
怱
怵
总
怼
怿
恁
恂
恃
恋
恍
恏
恐
恒
恕
恙
恚
恛
恢
恣
恤
恨
恩
恪
恫
恬
恭
息
恰
恳
恵
恶
恸
恹
恺
恻
恼
恽
恿
悄
悇
悈
悉
悌
悍
悎
悒
悓
悔
悖
悚
悛
悟
悠
患
悦
悧
您
悬
悭
悯
悰
悱
悲
悳
悴
悸
悻
悼
情
惆
惇
惉
惊
惋
惎
惑
惕
惘
惚
惜
惟
惠
惢
惦
惧
惨
惩
惫
惬
惭
惮
惯
惰
想
惴
惶
惹
惺
愀
愁
愃
愆
愈
愉
愍
愎
意
愔
愕
愙
愚
感
愠
愣
愤
愧
愪
愫
愬
愭
愮
愯
愰
愿
慆
慈
慌
慎
慑
慓
慕
慜
慝
慢
慦
慧
慨
慰
慱
慵
慷
慾
憋
憎
憔
憙
憟
憧
憨
憩
憬
憷
憾
憿
懀
懂
懈
懊
懋
懐
懑
懒
懔
懦
懵
懿
戆
戈
戊
戌
戍
戎
戏
成
我
戒
戓
戕
或
戗
战
戚
戛
戜
戝
戞
戟
戠
戡
戢
戥
戦
戨
截
戬
戮
戳
戴
户
戽
戾
房
所
扁
扃
扆
扇
扈
扉
手
扌
才
扎
扑
扒
打
扔
托
扙
扛
扞
扡
扣
扥
扦
执
扩
扪
扫
扬
扭
扮
扯
扰
扳
扶
批
扺
扼
扽
找
承
技
抄
抉
把
抐
抑
抒
抓
抔
投
抖
抗
折
抚
抛
抜
抝
抟
抠
抡
抢
护
报
抨
披
抬
抱
抲
抵
抹
抺
抻
押
抽
抿
拂
拃
拄
担
拆
拇
拈
拉
拊
拌
拍
拎
拐
拒
拓
拔
拖
拗
拘
拙
招
拜
拟
拢
拣
拥
拦
拧
拨
择
括
拭
拮
拯
拱
拳
拴
拶
拷
拸
拻
拼
拽
拾
拿
持
挂
指
挈
按
挎
挑
挖
挙
挚
挛
挝
挞
挟
挠
挡
挢
挣
挤
挥
挧
挨
挪
挫
振
挱
挲
挷
挹
挺
挻
挽
捂
捅
捆
捉
捊
捋
捌
捍
捎
捏
捐
捕
捜
捞
损
捡
换
捣
捧
捩
捭
据
捯
捱
捶
捷
捸
捺
捻
捽
掀
掁
掂
掇
授
掉
掊
掋
掌
掎
掏
掐
排
掔
掖
掘
掞
掠
探
掣
接
控
推
掩
措
掫
掬
掮
掰
掱
掳
掴
掷
掸
掹
掺
掼
掽
掾
掿
揄
揆
揉
揍
描
提
揑
插
揖
揗
揠
握
揣
揤
揩
揪
揭
揲
援
揶
揸
揼
揽
揾
揿
搀
搁
搂
搅
搌
搏
搐
搓
搔
搛
搜
搞
搠
搡
搥
搦
搧
搨
搪
搬
搭
搴
搵
搷
携
搽
搿
摁
摂
摄
摆
摇
摈
摊
摒
摔
摘
摞
摧
摩
摪
摬
摭
摰
摵
摸
摹
摺
摽
撂
撄
撅
撇
撑
撒
撕
撗
撘
撙
撝
撞
撤
撩
撬
播
撮
撰
撴
撵
撷
撸
撹
撺
撼
擀
擂
擅
操
擎
擒
擗
擘
擞
擢
擤
擦
擨
攀
攒
攘
攞
攠
攥
攧
攫
攮
支
攲
攴
攵
收
攸
改
攻
攽
放
政
故
效
敌
敎
敏
救
敓
敕
敖
教
敛
敝
敞
敢
散
敤
敦
敫
敬
数
敱
敲
整
敷
敼
斁
文
斋
斌
斐
斑
斒
斓
斗
料
斛
斜
斝
斟
斠
斡
斤
斥
斧
斩
斫
断
斯
新
斱
斸
方
於
施
斿
旀
旁
旃
旄
旅
旆
旈
旉
旋
旌
旎
族
旑
旒
旖
旗
无
旡
既
日
旦
旧
旨
早
旬
旭
旮
旯
旰
旱
旳
旴
时
旷
旸
旹
旺
旻
旼
旿
昀
昂
昃
昆
昇
昉
昊
昌
明
昏
易
昔
昕
昖
昙
昚
昜
昝
星
映
昡
昤
春
昦
昧
昨
昩
昪
昫
昭
是
昰
昱
昳
昴
昵
昶
昺
昼
昽
显
晁
晃
晄
晋
晌
晏
晒
晓
晔
晕
晖
晗
晙
晚
晛
晞
晟
晠
晡
晢
晣
晤
晦
晧
晨
晩
普
景
晰
晳
晴
晶
晷
晸
智
晾
暀
暂
暄
暇
暋
暌
暍
暎
暐
暑
暖
暗
暝
暠
暣
暧
暨
暮
暲
暳
暴
暹
暻
暾
曁
曈
曌
曏
曙
曚
曛
曜
曝
曞
曟
曢
曦
曩
曪
曰
曱
曲
曳
更
曵
曷
曹
曼
曽
曾
替
最
朁
朂
月
有
朊
朋
服
朎
朐
朒
朓
朔
朕
朗
望
朝
期
朢
朤
朥
朦
木
朩
未
末
本
札
术
朱
朲
朳
朴
朵
机
朽
杀
杂
权
杄
杅
杆
杈
杉
杌
李
杏
材
村
杓
杖
杜
杞
束
杠
条
来
杨
杩
杪
杭
杮
杯
杰
杲
杳
杵
杷
杼
松
板
极
枃
构
枇
枉
枊
枋
枏
析
枓
枕
林
枘
枚
果
枝
枞
枢
枣
枥
枧
枨
枪
枫
枭
枯
枰
枱
枳
架
枷
枸
枹
柁
柃
柄
柈
柉
柊
柏
某
柑
柒
染
柔
柘
柙
柚
柜
柝
柞
柟
柠
柢
柤
查
柦
柩
柬
柯
柰
柱
柲
柳
柴
柺
査
柽
柾
柿
栀
栃
栄
栅
栆
标
栈
栉
栊
栋
栌
栎
栏
栐
树
栓
栖
栗
栝
栟
栠
校
栢
栤
栨
栩
株
栬
栭
栯
栱
栲
栳
样
核
根
栺
栻
格
栽
栾
桀
桁
桂
桃
桄
桅
框
案
桉
桌
桎
桐
桑
桓
桔
桕
桖
桜
桝
桠
桡
桢
档
桤
桥
桦
桧
桨
桩
桫
桲
桴
桶
桷
桼
梁
梃
梅
梆
梈
梏
梓
梗
梢
梣
梦
梧
梨
梭
梯
械
梱
梲
梳
梵
梶
梼
梽
检
棂
棉
棋
棍
棐
棒
棓
棕
棘
棚
棠
棣
棤
棨
棩
棪
森
棰
棱
棵
棶
棹
棺
棻
棼
棽
棿
椁
椂
椃
椅
椇
椈
椋
植
椎
椐
椑
椒
椙
椟
椠
椤
椪
椭
椰
椴
椹
椽
椾
椿
楁
楂
楅
楔
楕
楚
楝
楞
楠
楢
楣
楤
楦
楩
楫
楮
楯
楱
楶
楷
楸
楹
楼
榀
概
榃
榄
榆
榈
榉
榎
榔
榕
榖
榘
榚
榛
榜
榣
榤
榧
榨
榫
榭
榴
榶
榷
榻
榼
槁
槃
槅
槇
槊
槌
槎
槐
槑
様
槙
槚
槛
槜
槟
槠
槭
槲
槴
槸
槽
槿
樉
樊
樋
樒
樘
樜
樟
模
樨
横
樫
樯
樱
樵
樼
樽
樾
橀
橄
橇
橐
橘
橙
橛
橞
橡
橥
橦
橱
橵
橹
橼
橿
檀
檄
檎
檐
檑
檗
檞
檥
檩
檫
檬
檭
檮
檵
檷
檼
櫈
櫑
欎
欐
欑
欓
欠
次
欢
欣
欤
欧
欰
欲
欵
欶
欷
欸
欹
欺
款
歃
歆
歇
歉
歌
歔
歘
歙
歜
止
正
此
步
武
歧
歩
歪
歮
歳
歴
歹
死
歼
殁
殂
殃
殄
殆
殇
殉
殊
残
殍
殏
殑
殒
殓
殖
殚
殛
殟
殡
殪
殭
殰
殳
殴
段
殷
殸
殿
毁
毂
毅
毊
毋
母
毎
每
毐
毑
毒
毓
比
毕
毖
毗
毙
毛
毡
毫
毯
毳
毵
毹
毽
氅
氆
氇
氍
氏
氐
民
氓
气
氖
気
氘
氙
氚
氛
氟
氠
氡
氢
氤
氥
氦
氧
氨
氩
氪
氭
氮
氯
氰
氱
氲
水
氵
氶
永
氹
氺
氽
汀
汁
求
汆
汇
汈
汉
汊
汏
汐
汒
汔
汕
汗
汛
汜
汝
汞
江
池
污
汤
汨
汩
汪
汫
汭
汰
汲
汴
汶
汹
汽
汾
汿
沁
沂
沃
沄
沅
沆
沇
沈
沉
沋
沌
沏
沐
沓
沔
沕
沙
沚
沛
沟
没
沢
沣
沤
沥
沦
沧
沨
沩
沪
沫
沬
沭
沮
沱
河
沴
沷
沸
油
沺
治
沼
沽
沾
沿
泂
泃
泄
泅
泇
泉
泊
泌
泐
泓
泔
法
泖
泗
泘
泚
泛
泜
泞
泠
泡
波
泣
泥
注
泪
泫
泭
泮
泯
泰
泱
泳
泵
泶
泷
泸
泺
泻
泼
泽
泾
洁
洄
洇
洈
洋
洌
洍
洎
洑
洒
洗
洙
洛
洜
洞
洠
洣
津
洧
洨
洪
洮
洰
洱
洲
洳
洴
洵
洸
洹
洺
活
洼
洽
派
洿
流
浃
浄
浅
浆
浇
浈
浉
浊
测
浍
济
浏
浐
浑
浒
浓
浔
浕
浙
浚
浛
浜
浞
浠
浣
浤
浥
浦
浨
浩
浪
浮
浯
浰
浴
海
浸
浼
浿
涂
涅
消
涉
涌
涎
涐
涑
涓
涔
涕
涖
涘
涙
涚
涛
涝
涞
涟
涠
涡
涢
涣
涤
润
涧
涨
涩
涪
涬
涮
涯
液
涳
涵
涸
涺
涿
淀
淂
淄
淅
淆
淇
淋
淌
淏
淑
淖
淘
淙
淛
淝
淞
淠
淡
淢
淤
淦
淩
淫
淬
淮
淯
深
淳
淴
混
淸
淹
添
淼
渀
渃
清
渇
渉
渊
渋
渌
渍
渎
渐
渑
渔
渕
渖
渗
渚
渝
渟
渠
渡
渣
渤
渥
温
渫
渭
港
渲
渳
渴
渶
游
渺
渼
湀
湁
湃
湄
湅
湇
湉
湋
湍
湎
湑
湓
湔
湖
湘
湛
湜
湟
湡
湢
湣
湪
湫
湬
湮
湲
湳
湴
湶
湸
湾
湿
満
溁
溃
溅
溆
溇
溉
溋
溍
溏
源
溘
溜
溟
溢
溣
溥
溦
溧
溪
溯
溱
溲
溴
溵
溶
溷
溺
溻
溽
溿
滁
滂
滃
滆
滇
滈
滉
滋
滏
滐
滑
滓
滔
滕
滗
滘
滙
滚
滝
滞
滟
滠
满
滢
滤
滥
滦
滨
滩
滴
滹
漂
漆
漈
漉
漏
漓
演
漕
漖
漙
漠
漡
漤
漥
漩
漪
漫
漭
漯
漱
漳
漶
漷
漺
漾
潀
潃
潅
潆
潇
潉
潋
潍
潏
潕
潖
潘
潜
潞
潟
潠
潢
潦
潧
潩
潪
潭
潮
潲
潴
潸
潹
潺
潼
潾
澂
澄
澈
澉
澋
澍
澎
澐
澔
澙
澜
澡
澥
澧
澨
澫
澯
澳
澴
澶
澸
澹
澼
澿
激
濂
濇
濈
濉
濋
濑
濒
濓
濛
濞
濠
濡
濬
濮
濯
濹
濿
瀍
瀐
瀑
瀚
瀛
瀞
瀣
瀬
瀴
瀵
瀹
瀼
瀿
灈
灌
灏
灜
灞
灠
灨
火
灬
灭
灯
灰
灵
灶
灸
灼
灾
灿
炀
炅
炆
炉
炊
炎
炒
炔
炕
炖
炘
炙
炜
炝
炟
炤
炫
炬
炭
炮
炯
炱
炲
炳
炵
炷
炸
点
炻
炼
炽
烀
烁
烂
烃
烈
烊
烎
烐
烓
烔
烕
烘
烙
烚
烛
烜
烝
烟
烤
烦
烧
烨
烩
烫
烬
热
烯
烰
烷
烹
烽
焇
焉
焊
焋
焌
焍
焐
焑
焓
焕
焖
焗
焘
焙
焚
焛
焜
焠
焢
焦
焯
焰
焱
然
焼
焾
焿
煁
煄
煅
煇
煊
煋
煌
煎
煐
煕
煜
煞
煠
煤
煦
照
煨
煮
煰
煲
煳
煶
煸
煺
煽
熄
熊
熋
熏
熔
熕
熘
熙
熜
熟
熠
熤
熨
熬
熳
熵
熶
熷
熸
熹
熺
熻
熼
燂
燃
燊
燎
燏
燔
燕
燚
燠
燡
燥
燧
燮
燹
燺
燻
燿
爀
爆
爇
爊
爎
爚
爝
爣
爨
爪
爬
爮
爰
爱
爲
爵
父
爷
爸
爹
爻
爽
爿
片
版
牌
牍
牒
牖
牙
牛
牜
牝
牞
牟
牠
牡
牢
牤
牦
牧
物
牮
牯
牲
牵
牸
特
牺
牾
犀
犁
犂
犄
犇
犊
犋
犍
犒
犟
犬
犭
犮
犯
犰
犲
犳
犵
状
犷
犸
犹
犺
犼
犽
狁
狂
狃
狄
狅
狈
狍
狎
狐
狒
狓
狗
狙
狝
狞
狠
狡
狨
狩
独
狭
狮
狰
狱
狲
狳
狷
狸
狻
狼
猁
猃
猄
猇
猊
猋
猎
猓
猕
猖
猗
猛
猜
猝
猞
猠
猡
猢
猥
猩
猪
猫
猬
献
猰
猴
猷
猸
猹
猾
猿
獏
獐
獒
獗
獠
獬
獭
獴
獾
玄
率
玉
王
玎
玏
玑
玕
玖
玗
玘
玙
玚
玛
玟
玠
玡
玢
玥
玦
玩
玫
玮
环
现
玲
玳
玷
玹
玺
玻
珀
珂
珅
珇
珈
珉
珊
珍
珎
珏
珐
珑
珗
珙
珛
珝
珞
珠
珣
珥
珦
珧
珩
珪
珫
班
珯
珰
珲
珵
珶
珺
珽
球
琄
琅
理
琇
琉
琊
琋
琍
琎
琏
琐
琚
琛
琠
琢
琣
琤
琥
琦
琨
琩
琪
琬
琭
琮
琯
琰
琲
琳
琴
琵
琶
琹
琻
琼
瑀
瑁
瑄
瑅
瑆
瑈
瑒
瑓
瑔
瑕
瑖
瑗
瑙
瑚
瑛
瑜
瑞
瑟
瑠
瑢
瑥
瑧
瑨
瑫
瑬
瑭
瑮
瑰
瑱
瑶
瑷
瑾
璀
璁
璃
璆
璇
璈
璋
璎
璏
璐
璕
璗
璘
璜
璞
璟
璠
璥
璧
璨
璩
璪
璺
璿
瓀
瓂
瓈
瓌
瓑
瓒
瓘
瓜
瓞
瓠
瓢
瓣
瓤
瓦
瓩
瓮
瓯
瓴
瓶
瓷
瓿
甁
甃
甄
甍
甑
甗
甘
甙
甚
甜
生
甡
甥
用
甩
甪
甫
甬
甭
甯
田
由
甲
申
甴
电
男
甸
町
画
甽
甾
畀
畄
畅
畇
畈
畊
畋
界
畏
畐
畑
畔
留
畚
畛
畜
畠
略
畦
番
畯
畲
畳
畴
畷
畸
畹
畾
畿
疃
疄
疆
疈
疋
疍
疎
疏
疑
疒
疔
疕
疖
疗
疙
疚
疝
疟
疠
疡
疣
疤
疥
疪
疫
疬
疮
疯
疰
疱
疲
疳
疴
疵
疸
疹
疼
疽
疾
痂
痄
病
症
痈
痉
痊
痍
痎
痒
痔
痕
痘
痛
痞
痟
痢
痣
痤
痦
痧
痨
痩
痪
痫
痰
痱
痴
痷
痹
痼
痿
瘀
瘁
瘆
瘉
瘊
瘌
瘐
瘕
瘗
瘘
瘙
瘛
瘟
瘠
瘢
瘤
瘥
瘦
瘩
瘪
瘫
瘭
瘮
瘰
瘳
瘴
瘵
瘸
瘼
瘽
瘾
瘿
癀
癃
癌
癍
癎
癒
癔
癖
癜
癞
癣
癫
癯
癸
発
登
白
百
癿
皂
的
皆
皇
皈
皋
皎
皐
皑
皓
皕
皖
皗
皙
皛
皞
皢
皤
皥
皦
皬
皮
皯
皱
皲
皴
皵
皼
皿
盂
盃
盅
盆
盈
盉
益
盌
盎
盏
盐
监
盒
盔
盖
盗
盘
盛
盟
盥
目
盯
盱
盲
直
相
盹
盺
盼
盾
眀
省
眈
眉
看
県
眍
眏
眙
眚
眛
眞
真
眠
眣
眦
眨
眩
眬
眭
眯
眳
眵
眶
眷
眸
眺
眼
着
睁
睃
睆
睇
睌
睍
睐
睑
睒
睚
睛
睡
睢
督
睥
睦
睨
睩
睫
睬
睰
睱
睴
睹
睺
睽
睾
睿
瞀
瞄
瞅
瞋
瞌
瞍
瞎
瞐
瞑
瞒
瞓
瞜
瞟
瞠
瞡
瞢
瞥
瞧
瞩
瞪
瞬
瞭
瞮
瞰
瞳
瞵
瞻
瞽
瞾
瞿
矅
矍
矖
矗
矛
矜
矞
矡
矢
矣
知
矩
矫
矬
短
矮
石
矶
矸
矽
矾
矿
砀
码
砂
砉
砌
砍
砑
砒
研
砖
砗
砚
砜
砝
砟
砠
砡
砢
砣
砥
砦
砧
砪
砬
砭
砯
砰
破
砵
砷
砸
砺
砻
砼
砾
础
硅
硇
硌
硎
硏
硐
硒
硕
硖
硙
硚
硝
硪
硫
硬
确
硰
硷
硼
碀
碁
碇
碉
碌
碍
碎
碑
碓
碕
碗
碘
碚
碛
碜
碟
碡
碣
碥
碧
碨
碪
碰
碱
碲
碳
碴
碶
碹
碾
磁
磂
磅
磉
磊
磋
磌
磐
磔
磕
磙
磜
磡
磦
磨
磬
磲
磴
磷
磺
磻
礀
礁
礅
礌
礐
礒
礓
礞
礠
礡
礤
礮
礴
礵
示
礼
礽
社
祀
祁
祆
祇
祈
祉
祊
祎
祐
祓
祖
祗
祘
祙
祚
祛
祜
祝
神
祟
祠
祢
祥
祧
票
祭
祯
祲
祷
祸
祹
祺
祼
祾
禀
禁
禄
禅
禇
禊
福
禕
禚
禛
禟
禤
禧
禳
禴
禹
禺
离
禽
禾
秀
私
秃
秆
秉
秋
种
秏
科
秒
秕
秖
秘
租
秡
秣
秤
秦
秧
秩
秫
秭
积
称
秱
秴
秶
秸
移
秽
秾
秿
稀
稂
稉
程
稍
税
稔
稗
稚
稞
稠
稢
稣
稲
稳
稷
稹
稻
稼
稽
稿
穂
穄
穆
穏
穑
穗
穝
穬
穰
穴
究
穷
穸
穹
空
穻
穿
窀
突
窃
窄
窅
窆
窈
窊
窍
窑
窒
窔
窕
窖
窗
窘
窜
窝
窟
窠
窣
窥
窦
窨
窬
窳
窸
窻
窾
窿
立
竑
竒
竖
站
竚
竜
竞
竟
章
竣
童
竦
竭
端
竴
竵
竷
竹
竺
竽
竿
笀
笂
笃
笄
笅
笆
笇
笈
笉
笊
笋
笍
笏
笑
笔
笕
笙
笛
笞
笟
笠
笤
笥
符
笨
笪
笫
第
笮
笳
笸
笹
笺
笼
笾
筇
等
筊
筋
筌
筎
筏
筐
筑
筒
答
策
筚
筛
筜
筝
筠
筯
筱
筲
筳
筴
筵
筷
筹
筼
签
简
箅
箍
箎
箐
箑
箓
箔
箕
算
箜
箝
箟
管
箢
箣
箤
箥
箦
箧
箨
箩
箪
箫
箬
箭
箮
箰
箱
箴
箸
篁
篆
篇
篌
篐
篑
篓
篕
篗
篙
篚
篜
篝
篡
篥
篦
篨
篪
篮
篯
篱
篷
篼
篾
簃
簇
簈
簋
簌
簏
簕
簖
簟
簠
簧
簪
簮
簯
簰
簲
簸
簿
籀
籁
籇
籍
籓
籖
籧
籯
米
籴
籹
类
籼
籽
粄
粉
粋
粍
粐
粑
粒
粕
粗
粘
粜
粝
粞
粟
粡
粢
粤
粥
粦
粧
粨
粪
粬
粮
粱
粲
粳
粶
粷
粸
粹
粼
粽
精
粿
糁
糅
糉
糊
糌
糍
糎
糕
糖
糗
糙
糜
糟
糠
糥
糨
糬
糯
糵
糸
系
紊
紑
紘
紝
素
索
紥
紧
紫
紬
紮
累
紸
絅
絈
経
絜
絩
絪
絮
絵
絶
絷
綅
綇
綉
綋
綍
綑
綝
綡
綦
綫
綮
緈
緉
緌
緍
緫
緭
緵
縁
縠
縢
縻
縼
繁
繇
繐
繖
繘
纂
纛
纟
纠
纡
红
纣
纤
纥
约
级
纨
纪
纫
纬
纭
纮
纯
纰
纱
纲
纳
纵
纶
纷
纸
纹
纺
纻
纽
纾
线
绀
绂
练
组
绅
细
织
终
绉
绊
绋
绌
绍
绎
经
绐
绑
绒
结
绔
绕
绗
绘
给
绚
绛
络
绝
绞
统
绠
绡
绢
绣
绤
绥
绦
继
绩
绪
绫
续
绮
绯
绰
绱
绳
维
绵
绶
绷
绸
绺
绻
综
绽
绾
绿
缀
缁
缂
缃
缄
缅
缆
缇
缈
缉
缊
缋
缌
缍
缎
缑
缒
缓
缔
缕
编
缗
缘
缙
缚
缛
缜
缝
缟
缠
缡
缢
缣
缤
缥
缦
缧
缨
缩
缪
缫
缬
缭
缮
缯
缰
缱
缲
缳
缴
缵
缶
缷
缸
缺
罂
罄
罅
罇
罊
罍
罐
网
罔
罕
罗
罘
罙
罚
罝
罟
罡
罢
罥
罧
罩
罪
置
罱
署
罹
罾
羁
羇
羊
羌
美
羑
羔
羙
羚
羞
羟
羠
羡
羣
群
羧
羮
羯
羰
羱
羲
羴
羸
羹
羼
羽
羿
翀
翁
翃
翅
翊
翌
翎
翔
翕
翘
翙
翚
翝
翟
翠
翡
翥
翦
翧
翨
翩
翬
翮
翰
翱
翳
翻
翼
翾
耀
老
考
耄
者
耆
耊
耋
而
耍
耐
耒
耔
耕
耗
耘
耙
耜
耥
耦
耧
耩
耪
耳
耵
耶
耷
耸
耻
耽
耿
聂
聃
聆
聊
聋
职
聍
聒
联
聕
聘
聚
聛
聟
聩
聪
聿
肃
肄
肆
肇
肉
肋
肌
肓
肖
肘
肚
肛
肜
肝
肟
肠
股
肢
肤
肥
肩
肪
肫
肭
肮
肯
肱
育
肴
肶
肷
肸
肺
肻
肼
肽
肾
肿
胀
胁
胂
胃
胄
胆
背
胍
胎
胕
胖
胗
胙
胚
胛
胜
胝
胞
胠
胡
胤
胥
胧
胨
胪
胫
胬
胭
胯
胰
胱
胳
胴
胶
胸
胺
胼
能
脂
脆
脉
脊
脍
脏
脐
脑
脒
脓
脖
脘
脚
脝
脞
脢
脤
脩
脬
脯
脱
脲
脳
脷
脸
脽
脾
腄
腆
腈
腊
腋
腌
腐
腑
腓
腔
腕
腘
腙
腚
腠
腥
腧
腩
腭
腮
腰
腱
腴
腷
腹
腺
腻
腼
腽
腾
腿
膀
膂
膈
膊
膏
膑
膘
膛
膜
膝
膣
膥
膦
膨
膰
膳
膺
膻
臀
臁
臂
臃
臆
臊
臑
臖
臜
臣
臧
自
臬
臭
臲
至
致
臵
臻
臼
臾
舀
舁
舂
舅
舆
舌
舍
舎
舐
舒
舔
舖
舙
舛
舜
舞
舟
舢
舣
舨
航
舫
般
舭
舯
舰
舱
舳
舴
舵
舶
舷
舸
船
舺
舾
艄
艇
艉
艋
艏
艗
艘
艚
艟
艨
艮
良
艰
色
艳
艶
艹
艺
艽
艾
艿
节
芃
芄
芈
芊
芋
芍
芎
芏
芑
芒
芔
芗
芘
芙
芜
芝
芟
芠
芡
芣
芤
芥
芦
芧
芨
芩
芪
芫
芬
芭
芮
芯
芰
花
芲
芳
芴
芶
芷
芸
芹
芼
芽
芾
苁
苄
苇
苈
苊
苋
苌
苍
苎
苏
苐
苑
苒
苓
苔
苕
苖
苗
苘
苛
苜
苞
苟
苠
苡
苢
苣
苤
若
苦
苨
苪
苫
苯
英
苳
苴
苶
苷
苹
苺
苻
苼
苽
苾
茁
茂
范
茄
茅
茆
茇
茈
茉
茋
茌
茎
茏
茑
茔
茕
茗
茘
茚
茛
茜
茧
茨
茫
茬
茭
茯
茱
茳
茴
茵
茶
茸
茹
茺
茼
荀
荃
荄
荆
荇
草
荏
荐
荑
荒
荔
荖
荗
荘
荙
荚
荛
荜
荞
荟
荠
荡
荣
荤
荥
荦
荧
荨
荩
荪
荫
荬
荭
荮
药
荳
荷
荸
荻
荼
荽
莅
莆
莉
莎
莐
莒
莓
莘
莛
莜
莞
莟
莠
莣
莨
莪
莫
莱
莲
莳
莴
莶
获
莸
莹
莺
莼
莽
莿
菀
菁
菂
菅
菇
菈
菉
菊
菌
菎
菏
菑
菓
菔
菖
菘
菜
菝
菟
菠
菡
菥
菩
菪
菰
菱
菲
菸
菹
菺
菻
菽
菿
萀
萁
萃
萄
萆
萋
萌
萍
萎
萏
萐
萘
萜
萝
萣
萤
营
萦
萧
萨
萩
萱
萸
萼
落
葆
葇
葎
葑
葓
著
葙
葚
葛
葜
葡
葢
董
葩
葫
葬
葭
葱
葳
葵
葶
葺
葼
蒀
蒂
蒉
蒋
蒌
蒎
蒐
蒕
蒗
蒙
蒜
蒟
蒡
蒨
蒯
蒲
蒴
蒸
蒹
蒺
蒻
蒽
蒿
蓁
蓂
蓄
蓆
蓉
蓊
蓍
蓐
蓑
蓓
蓖
蓝
蓟
蓠
蓢
蓣
蓥
蓦
蓬
蓷
蓼
蓿
蔄
蔌
蔑
蔓
蔗
蔘
蔚
蔟
蔡
蔫
蔬
蔴
蔵
蔷
蔸
蔹
蔺
蔻
蔼
蔽
蕃
蕈
蕉
蕊
蕖
蕙
蕞
蕡
蕣
蕤
蕥
蕨
蕰
蕲
蕴
蕸
蕹
蕺
蕻
蕾
薄
薅
薆
薇
薏
薐
薘
薙
薛
薜
薢
薤
薨
薪
薫
薮
薯
薰
薶
薷
薹
藁
藉
藏
藐
藓
藕
藜
藞
藠
藤
藨
藩
藴
藻
藿
蘀
蘅
蘍
蘑
蘖
蘘
蘧
蘩
蘸
蘼
虂
虎
虏
虐
虑
虒
虓
虔
虚
虞
虢
虣
虫
虬
虱
虹
虺
虻
虽
虾
虿
蚀
蚁
蚂
蚊
蚋
蚌
蚍
蚓
蚕
蚖
蚜
蚝
蚣
蚤
蚧
蚨
蚩
蚪
蚬
蚯
蚰
蚱
蚴
蚵
蚶
蚷
蚺
蛀
蛄
蛆
蛇
蛉
蛊
蛋
蛎
蛏
蛐
蛑
蛔
蛘
蛙
蛛
蛞
蛟
蛤
蛩
蛭
蛮
蛰
蛱
蛲
蛳
蛴
蛸
蛹
蛾
蜀
蜂
蜃
蜄
蜇
蜈
蜉
蜊
蜍
蜒
蜓
蜕
蜗
蜘
蜚
蜜
蜞
蜡
蜢
蜣
蜥
蜩
蜮
蜰
蜱
蜴
蜷
蜻
蜾
蜿
蝇
蝈
蝉
蝌
蝎
蝓
蝗
蝙
蝠
蝣
蝤
蝥
蝨
蝪
蝮
蝰
蝴
蝶
蝻
蝼
蝽
蝾
螂
螃
螅
螈
螋
融
螓
螗
螟
螣
螨
螫
螬
螭
螯
螳
螵
螺
螽
蟀
蟆
蟊
蟋
蟑
蟒
蟓
蟛
蟝
蟠
蟥
蟧
蟪
蟫
蟮
蟹
蟾
蠃
蠄
蠊
蠋
蠍
蠓
蠕
蠖
蠛
蠡
蠢
蠲
蠵
蠹
蠼
血
衄
衅
衆
行
衍
衎
衐
衔
衖
街
衙
衜
衞
衡
衢
衣
补
表
衩
衫
衬
衮
衰
衲
衷
衽
衾
衿
袁
袂
袄
袅
袆
袈
袊
袋
袍
袐
袒
袓
袖
袛
袜
袢
袤
袪
被
袭
袯
袱
袴
袷
袺
袿
裁
裂
裄
装
裆
裇
裉
裎
裔
裕
裘
裙
裟
裢
裤
裥
裨
裰
裱
裳
裴
裵
裸
裹
裼
裾
褀
褂
褄
褆
褊
褐
褒
褓
褔
褙
褚
褛
褟
褡
褥
褪
褫
褰
褴
褵
褶
襁
襄
襜
襞
襟
襦
襫
襭
襻
西
要
覃
覅
覆
覊
覌
覑
覥
観
见
观
觃
规
觅
视
觇
览
觉
觊
觌
觍
觎
觏
觐
觑
角
觖
觚
觜
觞
觟
解
觥
触
觯
觳
觽
言
訇
訏
訚
訫
訳
訷
訸
訾
詄
詈
詝
詹
誃
誉
誊
誐
誓
誔
誜
説
諨
諰
諻
謇
謢
謦
謧
譀
譞
警
譪
譬
讃
讆
讉
讠
计
订
讣
认
讥
讦
讧
讨
让
讪
讫
训
议
讯
记
讲
讳
讴
讵
讶
讷
许
讹
论
讻
讼
讽
设
访
诀
证
诂
诃
评
诅
识
诈
诉
诊
诋
诌
词
诎
诏
译
诒
诓
诔
试
诗
诘
诙
诚
诛
诜
话
诞
诟
诠
诡
询
诣
诤
该
详
诧
诨
诩
诫
诬
语
诮
误
诰
诱
诲
诳
说
诵
诶
请
诸
诹
诺
读
诼
诽
课
诿
谀
谁
谂
调
谄
谅
谆
谇
谈
谊
谋
谌
谍
谎
谏
谐
谑
谒
谓
谔
谕
谖
谗
谘
谙
谚
谛
谜
谝
谞
谟
谠
谡
谢
谣
谤
谥
谦
谧
谨
谩
谪
谬
谭
谮
谯
谰
谱
谲
谳
谴
谵
谶
谷
谸
谿
豁
豆
豇
豉
豊
豋
豌
豕
豚
象
豢
豧
豨
豪
豫
豳
豸
豹
豺
豽
貂
貅
貉
貊
貌
貎
貔
貘
貤
貭
賛
賨
贇
贜
贝
贞
负
贠
贡
财
责
贤
败
账
货
质
贩
贪
贫
贬
购
贮
贯
贰
贱
贲
贳
贴
贵
贶
贷
贸
费
贺
贻
贼
贽
贾
贿
赀
赁
赂
赃
资
赅
赆
赈
赉
赊
赋
赌
赍
赎
赏
赐
赑
赒
赓
赔
赕
赖
赘
赙
赚
赛
赜
赝
赞
赟
赠
赡
赢
赣
赤
赥
赦
赧
赪
赫
赭
赯
走
赳
赴
赵
赶
起
赽
趁
趄
超
越
趋
趍
趔
趟
趣
趯
足
趴
趵
趸
趺
趾
趿
跂
跃
跄
跆
跋
跌
跎
跏
跐
跑
跓
跖
跗
跚
跛
距
跟
跣
跤
跦
跨
跩
跪
跫
跬
路
跳
践
跶
跷
跸
跹
跺
跻
踀
踅
踉
踊
踌
踏
踔
踘
踝
踞
踟
踢
踣
踩
踪
踬
踭
踮
踯
踱
踵
踷
踹
踺
踼
踽
蹀
蹁
蹂
蹄
蹇
蹈
蹉
蹊
蹋
蹍
蹑
蹒
蹓
蹙
蹚
蹝
蹞
蹟
蹦
蹧
蹩
蹬
蹭
蹯
蹰
蹲
蹴
蹶
蹼
蹾
蹿
躁
躅
躇
躏
身
躬
躯
躲
躹
躺
軎
軏
転
軿
輂
輋
輗
轇
轊
轕
轣
车
轧
轨
轩
轫
转
轭
轮
软
轰
轱
轲
轳
轴
轵
轶
轸
轹
轺
轻
轼
载
轾
轿
辂
较
辄
辅
辆
辇
辈
辉
辊
辋
辍
辎
辏
辐
辑
输
辔
辕
辖
辗
辘
辙
辚
辛
辜
辞
辟
辣
辨
辩
辫
辰
辱
边
辻
込
辽
达
迁
迂
迄
迅
过
迈
迎
迏
运
近
迓
返
迕
还
这
迚
进
远
违
连
迟
迢
迤
迥
迦
迨
迩
迪
迫
迭
述
迳
迷
迸
迹
迻
迼
追
退
送
适
逃
逄
逅
逆
逈
选
逊
逋
逌
逍
透
逐
逑
递
途
逖
逗
通
逛
逝
逞
速
造
逡
逢
逥
逦
逬
逭
逮
逯
逵
逶
逸
逹
逻
逼
逾
遁
遂
遄
遆
遇
遍
遏
遐
遑
遒
道
遗
遛
遢
遣
遥
遨
遭
遮
遯
遴
遵
遶
遹
遽
避
邀
邂
邃
邅
邈
邋
邑
邓
邕
邗
邘
邙
邛
邝
邠
邡
邢
那
邦
邨
邪
邬
邮
邯
邰
邱
邲
邳
邴
邵
邸
邹
邺
邻
邾
郁
郄
郅
郇
郉
郊
郎
郏
郐
郑
郓
郖
郗
郙
郛
郜
郝
郞
郡
郢
郤
郦
郧
部
郪
郫
郭
郯
郰
郴
郸
都
郾
鄂
鄄
鄈
鄘
鄙
鄚
鄞
鄢
鄣
鄯
鄱
鄹
酀
酃
酆
酇
酉
酊
酋
酌
配
酎
酏
酐
酒
酔
酗
酚
酝
酞
酡
酢
酣
酤
酥
酦
酧
酩
酪
酬
酮
酯
酰
酱
酲
酳
酴
酵
酶
酷
酸
酹
酽
酿
醅
醇
醉
醋
醌
醍
醐
醒
醚
醛
醡
醢
醣
醪
醭
醮
醯
醱
醴
醵
醺
釆
采
釉
释
里
重
野
量
金
釜
釭
釺
釿
鈈
鈊
鈎
鈗
鈘
鈜
鈡
鈪
鉄
鉏
鉢
鉥
鉴
鉷
鉼
鉾
銆
銍
銕
銗
銙
銤
銭
銮
銶
鋆
鋈
鋐
鋕
鋬
鋭
錋
錞
錡
錬
錰
錾
錿
鍀
鍎
鍏
鍐
鍑
鍒
鍓
鍖
鍗
鍙
鍚
鍜
鍝
鍠
鍦
鍩
鍪
鍮
鍱
鎅
鎌
鎏
鎛
鎱
鎴
鎶
鎸
鎹
鎺
鎻
鎾
鏀
鏁
鏂
鏄
鏅
鏉
鏊
鏖
鐑
鐕
鐗
鐜
鐞
鐢
鐧
鐩
鐪
鑓
鑚
鑫
鑱
鑳
鑸
鑻
钅
钆
钇
针
钉
钊
钋
钌
钍
钎
钏
钐
钒
钓
钔
钕
钖
钗
钙
钚
钛
钜
钝
钞
钟
钠
钡
钢
钣
钤
钥
钦
钧
钨
钩
钪
钫
钬
钭
钮
钯
钰
钱
钲
钳
钴
钵
钶
钷
钸
钹
钺
钻
钼
钽
钾
钿
铀
铁
铂
铃
铄
铅
铆
铇
铈
铉
铊
铋
铌
铍
铎
铐
铑
铒
铓
铕
铖
铗
铙
铛
铜
铝
铞
铟
铠
铡
铢
铣
铤
铥
铧
铨
铩
铪
铫
铬
铭
铮
铯
铰
铱
铲
铳
铵
银
铷
铸
铹
铺
铼
铽
链
铿
销
锁
锂
锃
锄
锅
锆
锇
锈
锉
锋
锌
锍
锎
锏
锐
锑
锒
锔
锕
锖
锗
锘
错
锚
锛
锜
锝
锞
锟
锠
锡
锢
锣
锤
锥
锦
锨
锪
锫
锭
键
锯
锰
锱
锲
锴
锵
锶
锷
锹
锺
锻
锼
锾
镀
镁
镂
镄
镆
镇
镈
镉
镊
镋
镌
镍
镏
镐
镑
镒
镓
镔
镕
镖
镗
镘
镙
镚
镛
镜
镝
镞
镟
镠
镡
镢
镣
镤
镥
镦
镧
镨
镪
镫
镬
镭
镯
镰
镱
镲
镳
镴
镶
镸
镺
镼
长
閈
閞
関
閮
閰
閲
闀
闄
闅
闇
门
闩
闪
闫
闭
问
闯
闰
闱
闲
闳
间
闵
闶
闷
闸
闹
闺
闻
闼
闽
闾
闿
阀
阁
阂
阃
阄
阅
阆
阇
阈
阉
阊
阋
阌
阍
阎
阏
阐
阑
阒
阔
阕
阖
阗
阙
阚
阜
阝
队
阡
阪
阮
阱
防
阳
阴
阵
阶
阻
阾
阿
陀
陂
附
际
陆
陇
陈
陉
陋
陌
降
限
陔
陕
陛
陞
陟
陡
院
除
陨
险
陪
陬
陲
陵
陶
陷
険
隅
隆
隈
隋
隍
随
隐
隑
隔
隗
隘
隙
障
隠
隧
隰
隳
隶
隹
隼
隽
难
雀
雁
雄
雅
集
雇
雉
雌
雍
雎
雏
雐
雑
雒
雕
雝
雠
雥
雨
雩
雪
雫
雯
雰
雳
零
雷
雹
雾
需
霁
霂
霄
霆
震
霈
霉
霍
霎
霏
霓
霖
霙
霜
霞
霦
霨
霪
霭
霰
霱
露
霸
霹
霾
靎
靑
青
靓
靕
靖
静
靛
非
靠
靡
面
靣
靥
革
靰
靳
靴
靶
靸
靺
靼
鞅
鞆
鞋
鞍
鞑
鞔
鞘
鞚
鞠
鞣
鞥
鞧
鞨
鞭
鞮
鞯
鞴
韡
韦
韧
韩
韪
韫
韬
韭
韮
韯
音
韵
韶
韺
頔
頚
頫
顒
顔
顗
页
顶
顷
顸
项
顺
须
顼
顽
顾
顿
颀
颁
颂
预
颅
领
颇
颈
颉
颊
颋
颌
颍
颎
颏
颐
频
颓
颔
颖
颗
题
颙
颚
颛
颜
额
颞
颟
颠
颡
颢
颤
颦
颧
颷
颿
飈
风
飏
飐
飑
飒
飓
飕
飖
飘
飙
飚
飞
食
飧
飨
餍
餐
餬
餮
餸
饍
饎
饔
饕
饥
饧
饨
饩
饪
饫
饬
饭
饮
饯
饰
饱
饲
饴
饵
饶
饷
饸
饹
饺
饼
饽
饾
饿
馀
馁
馃
馄
馅
馆
馇
馈
馊
馋
馌
馍
馏
馐
馑
馒
馓
馔
馕
首
馗
香
馝
馞
馣
馥
馨
馼
駪
騀
騃
騄
騉
騋
騐
騛
驎
驩
驫
马
驭
驮
驯
驰
驱
驳
驴
驶
驷
驸
驹
驺
驻
驼
驽
驾
驿
骀
骁
骂
骄
骅
骆
骇
骈
骉
骊
骋
验
骎
骏
骐
骑
骓
骕
骖
骗
骘
骙
骚
骛
骜
骝
骞
骟
骠
骡
骢
骤
骥
骧
骨
骰
骱
骶
骷
骸
骺
骼
髀
髁
髂
髃
髄
髅
髈
髋
髌
髎
髑
髓
高
髙
髟
髡
髢
髣
髤
髦
髩
髫
髭
髯
髴
髵
髶
髷
髸
髹
髺
髻
髼
鬃
鬄
鬈
鬑
鬓
鬟
鬣
鬯
鬰
鬲
鬶
鬻
鬼
魁
魂
魃
魄
魅
魆
魇
魈
魉
魊
魍
魏
魑
魔
魟
魠
魩
魽
鮀
鮈
鮎
鮟
鮠
鮡
鮢
鮣
鮨
鮰
鮸
鮻
鯓
鯬
鯮
鯻
鰆
鰛
鰯
鱆
鱇
鱠
鱤
鱥
鱲
鱼
鱿
鲀
鲁
鲂
鲃
鲅
鲆
鲇
鲈
鲉
鲊
鲋
鲌
鲍
鲎
鲏
鲐
鲑
鲒
鲔
鲕
鲗
鲘
鲚
鲛
鲜
鲞
鲟
鲠
鲢
鲣
鲤
鲥
鲦
鲧
鲨
鲩
鲪
鲫
鲭
鲮
鲱
鲲
鲳
鲴
鲵
鲶
鲷
鲸
鲹
鲻
鲼
鲽
鲿
鳀
鳁
鳃
鳄
鳅
鳇
鳈
鳉
鳊
鳌
鳍
鳎
鳏
鳐
鳑
鳒
鳔
鳕
鳖
鳗
鳙
鳜
鳝
鳞
鳟
鳠
鳡
鳢
鳤
鳯
鳽
鴜
鴠
鵏
鵔
鵟
鵩
鵰
鵷
鵸
鵾
鶄
鶏
鶭
鶸
鷀
鷇
鷉
鷌
鸀
鸁
鸈
鸉
鸊
鸐
鸟
鸠
鸡
鸢
鸣
鸤
鸥
鸦
鸨
鸩
鸪
鸫
鸬
鸭
鸮
鸯
鸰
鸱
鸲
鸳
鸵
鸶
鸷
鸸
鸹
鸺
鸻
鸼
鸽
鸾
鸿
鹀
鹁
鹂
鹃
鹄
鹅
鹇
鹈
鹉
鹊
鹋
鹌
鹍
鹎
鹏
鹑
鹓
鹕
鹖
鹗
鹘
鹚
鹛
鹜
鹞
鹟
鹠
鹣
鹤
鹦
鹧
鹩
鹪
鹫
鹬
鹭
鹮
鹯
鹰
鹱
鹲
鹳
鹿
麂
麇
麈
麋
麒
麓
麖
麛
麝
麟
麤
麦
麯
麴
麸
麻
麽
麾
麿
黄
黉
黍
黎
黏
黐
黑
黒
黔
默
黙
黛
黜
黝
黟
黠
黡
黢
黥
黦
黧
黩
黪
黯
黻
黼
黾
鼋
鼍
鼎
鼐
鼓
鼗
鼙
鼠
鼢
鼩
鼬
鼯
鼱
鼷
鼹
鼻
鼾
齁
齐
齑
齢
齨
齿
龀
龃
龄
龅
龆
龇
龈
龉
龊
龋
龌
龑
龖
龘
龙
龚
龛
龟
龠
龢